run/dropletInShearFlowBig/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            patch;
        nFaces          45;
        startFace       3960;
    }
    bottom
    {
        type            patch;
        nFaces          45;
        startFace       4005;
    }
    left
    {
        type            patch;
        nFaces          45;
        startFace       4050;
    }
    right
    {
        type            patch;
        nFaces          45;
        startFace       4095;
    }
    frontAndBack
    {
        type            patch;
        nFaces          4050;
        startFace       4140;
    }
)


// ************************************************************************* //
