run/dropletInShearFlowBig/system/dgSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "system";
    object      dgSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dgDdtSchemes
{
}

dgDivSchemes
{
}

dgLaplacianSchemes
{
}

dgCahnHilliardSchemes
{
    dgCahnHilliard(cu) bosssCahnHilliard;
}

fluxRequired
{
}


// ************************************************************************* //
